app/controllers/api/v1/sessions_controller.rb

  def create
    user = User.find_for_database_authentication(email: params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'dileep6@plowz.com' ORDER BY `users`.`id` ASC LIMIT 1